import time
import json
import pandas as pd
import requests
from pandas.io.json import json_normalize

###通过行政区划提取数据
#all_region=['太原市杏花岭区','太原市小店区','太原市迎泽区','太原市尖草坪区','太原市万柏林区','太原市晋源区','太原市古交市','太原市清徐县','太原市阳曲县','太原市娄烦县','大同市城区','大同市矿区','大同市南郊区','大同市新荣区','大同市阳高县','大同市天镇县','大同市广灵县','大同市灵丘县','大同市浑源县','大同市左云县','大同市大同县','阳泉市城区','阳泉市矿区','阳泉市郊区','阳泉市平定县','阳泉市盂县','长治市城区','长治市郊区','长治市潞城市','长治市长治县','长治市襄垣县','长治市屯留县','长治市平顺县','长治市黎城县','长治市壶关县','长治市长子县','长治市武乡县','长治市沁县','长治市沁源县','晋城市城区','晋城市泽州县','晋城市高平市','晋城市阳城县','晋城市陵川县','晋城市沁水县','朔州市朔城区','朔州市平鲁区','朔州市山阴县','朔州市应县','朔州市右玉县','朔州市怀仁县','晋中市榆次区','晋中市介休市','晋中市太谷县','晋中市祁县','晋中市平遥县','晋中市灵石县','晋中市寿阳县','晋中市昔阳县','晋中市和顺县','晋中市左权县','晋中市榆社县','运城市盐湖区','运城市空港新区','运城市永济市','运城市河津市','运城市芮城县','运城市临猗县','运城市万荣县','运城市新绛县','运城市稷山县','运城市闻喜县','运城市夏县','运城市绛县','运城市平陆县','运城市垣曲县','忻州市忻府区','忻州市原平市','忻州市定襄县','忻州市五台县','忻州市代县','忻州市繁峙县','忻州市宁武县','忻州市静乐县','忻州市神池县','忻州市五寨县','忻州市岢岚县','忻州市河曲县','忻州市保德县','忻州市偏关县','临汾市尧都区','临汾市侯马市','临汾市霍州市','临汾市曲沃县','临汾市翼城县','临汾市襄汾县','临汾市洪洞县','临汾市古县','临汾市安泽县','临汾市浮山县','临汾市吉县','临汾市乡宁县','临汾市蒲县','临汾市大宁县','临汾市永和县','临汾市隰县','临汾市汾西县','吕梁市离石区','吕梁市孝义市','吕梁市汾阳市','吕梁市文水县','吕梁市中阳县','吕梁市兴县','吕梁市临县','吕梁市方山县','吕梁市柳林县','吕梁市岚县','吕梁市交口县','吕梁市交城县','吕梁市石楼县']
all_region=['太原市杏花岭区','太原市尖草坪区','太原市万柏林区','太原市晋源区','太原市古交市','太原市清徐县','太原市阳曲县','太原市娄烦县','大同市新荣区','大同市阳高县','大同市天镇县','大同市广灵县','大同市灵丘县','大同市浑源县','大同市左云县','大同市大同县','阳泉市平定县','阳泉市盂县','长治市潞城市','长治市长治县','长治市襄垣县','长治市屯留县','长治市平顺县','长治市黎城县','长治市壶关县','长治市长子县','长治市武乡县','长治市沁县','长治市沁源县','晋城市泽州县','晋城市高平市','晋城市陵川县','晋城市沁水县','朔州市朔城区','朔州市平鲁区','朔州市山阴县','朔州市应县','朔州市右玉县','朔州市怀仁县','晋中市榆次区','晋中市介休市','晋中市太谷县','晋中市祁县','晋中市灵石县','晋中市寿阳县','晋中市昔阳县','晋中市和顺县','晋中市左权县','晋中市榆社县','运城市永济市','运城市河津市','运城市芮城县','运城市临猗县','运城市万荣县','运城市新绛县','运城市稷山县','运城市闻喜县','运城市夏县','运城市绛县','运城市平陆县','运城市垣曲县','忻州市忻府区','忻州市原平市','忻州市定襄县','忻州市代县','忻州市繁峙县','忻州市宁武县','忻州市静乐县','忻州市神池县','忻州市五寨县','忻州市岢岚县','忻州市河曲县','忻州市保德县','忻州市偏关县','临汾市侯马市','临汾市霍州市','临汾市曲沃县','临汾市翼城县','临汾市襄汾县','临汾市洪洞县','临汾市古县','临汾市安泽县','临汾市浮山县','临汾市吉县','临汾市乡宁县','临汾市蒲县','临汾市大宁县','临汾市永和县','临汾市隰县','临汾市汾西县','吕梁市离石区','吕梁市孝义市','吕梁市汾阳市','吕梁市文水县','吕梁市中阳县','吕梁市兴县','吕梁市临县','吕梁市方山县','吕梁市柳林县','吕梁市岚县','吕梁市交口县','吕梁市交城县','吕梁市石楼县']
all_region=['吕梁市兴县','吕梁市临县','吕梁市方山县','吕梁市柳林县','吕梁市岚县','吕梁市交口县','吕梁市交城县','吕梁市石楼县']
region1=['太原市小店区','太原市迎泽区','大同市城区','大同市矿区','大同市南郊区','阳泉市城区','阳泉市矿区','阳泉市郊区','长治市城区','长治市郊区','晋城市城区','晋城市阳城县','晋中市平遥县','运城市盐湖区','运城市空港新区','忻州市五台县','临汾市尧都区']
url0='http://api.map.baidu.com/place/v2/search?q=酒店&region='
url1='&page_size=20&page_num='
url2='&output=json&ak=ONzSMFNjStddVEbVfLLfPanEC6YYGi7L'

df = pd.DataFrame()
for region in all_region:
 for k in range(20):
  url = url0+region+url1+str(k)+url2
  time.sleep(10)
  r = requests.get(url)
  hotels = json.loads(r.text)['results']
  for h in hotels:
   uid=h['uid']
   hotel_name=h['name']
   address=h['address']
   province=h['province']
   city=h['city']
   area=h['area']
   if h.__contains__('telephone'):
    telephone=h['telephone']
   else:
    telephone=' '
   df=df.append([[uid,hotel_name,address,province,city,area,telephone]])

df.to_csv("hotels_list2.csv",  encoding='utf_8_sig')


###通过区间提取数据
url0='http://api.map.baidu.com/place/v2/search?query=酒店&page_size=20&page_num='
url1='&scope=1&bounds='
url2='&output=json&ak=ONzSMFNjStddVEbVfLLfPanEC6YYGi7L'

all_region=[
'37.603169,112.377499,37.968142,112.795902',
'37.803189,112.530291,37.853869,112.744295',
'39.987201,113.129651,40.182837,113.454478',
'39.859842,112.835275,40.190463,113.496428',
'39.755521,113.485666,40.498727,114.049083',
'37.840441,113.536429,37.912446,113.657162',
'37.854581,113.48678,37.854581,113.48678',
'37.768019,113.22231,38.145855,113.740883',
'35.380481,112.639391,35.701904,113.093575',
'35.188084,111.976467,35.708417,112.684763',
'35.312488,111.196397,37.381874,112.535456',
'34.811392,110.708868,35.312488,111.196397',
'35.092203,111.037787,35.126161,111.079468',
'38.584289,112.98089,39.107637,113.750127',
'35.916609,111.298974,36.261003,111.87044',
'36.121593,112.971994,36.454167,113.246804',
'35.89502,112.92691,36.117385,113.20057',
'36.073948,112.504079,36.548575,112.997356',
'36.218889,113.027459,36.543391,113.418401']

all_region=[
'39.755521,113.485666,40.498727,114.049083',
'37.840441,113.536429,37.912446,113.657162',
'37.768019,113.22231,38.145855,113.740883',
'35.380481,112.639391,35.701904,113.093575',
'35.092203,111.037787,35.126161,111.079468',
'35.89502,112.92691,36.117385,113.20057',
'36.073948,112.504079,36.548575,112.997356',
'36.218889,113.027459,36.543391,113.418401']


df = pd.DataFrame()
for region in all_region:
 for k in range(20):
  url = url0+str(k)+url1+region+url2
  time.sleep(10)
  r = requests.get(url)
  hotels = json.loads(r.text)['results']
  for h in hotels:
   uid=h['uid']
   hotel_name=h['name']
   address=h['address']
   province=h['province']
   city=h['city']
   area=h['area']
   if h.__contains__('telephone'):
    telephone=h['telephone']
   else:
    telephone=' '
   df=df.append([[uid,hotel_name,address,province,city,area,telephone]])

df.to_csv("hotels_list3.csv",  encoding='utf_8_sig')